backend: tensorflow
class_name: Sequential
config:
- class_name: Conv2D
  config:
    activation: relu
    activity_regularizer: null
    batch_input_shape: !!python/tuple [null, 128, 128, 1]
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {dtype: float32}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: &id001 !!python/tuple [1, 1]
    dtype: float32
    filters: 32
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: truncated_normal, dtype: float32, mode: fan_in, scale: 1.0,
        seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [3, 3]
    name: conv2d_3
    padding: valid
    strides: &id002 !!python/tuple [1, 1]
    trainable: true
    use_bias: true
- class_name: MaxPooling2D
  config:
    data_format: channels_last
    dtype: float32
    name: max_pooling2d
    padding: valid
    pool_size: !!python/tuple [2, 2]
    strides: !!python/tuple [2, 2]
    trainable: true
- class_name: Dropout
  config: {dtype: float32, name: dropout, noise_shape: null, rate: 0.2, seed: null,
    trainable: true}
- class_name: Conv2D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {dtype: float32}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: *id001
    dtype: float32
    filters: 64
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: truncated_normal, dtype: float32, mode: fan_in, scale: 1.0,
        seed: null}
    kernel_regularizer: null
    kernel_size: &id003 !!python/tuple [3, 3]
    name: conv2d_4
    padding: valid
    strides: *id002
    trainable: true
    use_bias: true
- class_name: MaxPooling2D
  config:
    data_format: channels_last
    dtype: float32
    name: max_pooling2d_1
    padding: valid
    pool_size: !!python/tuple [2, 2]
    strides: !!python/tuple [2, 2]
    trainable: true
- class_name: Dropout
  config: {dtype: float32, name: dropout_1, noise_shape: null, rate: 0.2, seed: null,
    trainable: true}
- class_name: Conv2D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {dtype: float32}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: *id001
    dtype: float32
    filters: 64
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: truncated_normal, dtype: float32, mode: fan_in, scale: 1.0,
        seed: null}
    kernel_regularizer: null
    kernel_size: *id003
    name: conv2d_5
    padding: valid
    strides: *id002
    trainable: true
    use_bias: true
- class_name: MaxPooling2D
  config:
    data_format: channels_last
    dtype: float32
    name: max_pooling2d_2
    padding: valid
    pool_size: !!python/tuple [2, 2]
    strides: !!python/tuple [2, 2]
    trainable: true
- class_name: Dropout
  config: {dtype: float32, name: dropout_2, noise_shape: null, rate: 0.2, seed: null,
    trainable: true}
- class_name: Flatten
  config: {data_format: channels_last, dtype: float32, name: flatten, trainable: true}
- class_name: Dense
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {dtype: float32}
    bias_regularizer: null
    dtype: float32
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: truncated_normal, dtype: float32, mode: fan_in, scale: 1.0,
        seed: null}
    kernel_regularizer: null
    name: dense
    trainable: true
    units: 64
    use_bias: true
- class_name: Dense
  config:
    activation: softmax
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {dtype: float32}
    bias_regularizer: null
    dtype: float32
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: truncated_normal, dtype: float32, mode: fan_in, scale: 1.0,
        seed: null}
    kernel_regularizer: null
    name: dense_1
    trainable: true
    units: 2
    use_bias: true
keras_version: 2.1.6-tf
